{
  "video_id": "kD3-DKkiVeA",
  "youtube_url": "https://www.youtube.com/watch?v=kD3-DKkiVeA",
  "video_info": {
    "video_path": "storage/kD3-DKkiVeA.mp4",
    "title": "Why you feel stuck — and how to get motivated - Shannon Odell",
    "duration": 300,
    "video_id": "kD3-DKkiVeA"
  },
  "transcript_segments": 74,
  "frames_extracted": 6,
  "frame_descriptions": [
    {
      "timestamp": 0,
      "timestamp_formatted": "00:00",
      "description": "The image is a logo on a white background. In large, bold letters, the text \"TED\" is written in red with a textured, hand-drawn appearance. Next to it, \"Ed\" is in black, also with a similar texture. Below this, there is smaller, black text that reads \"LESSONS WORTH SHARING.\" The overall design is clean and simple, focusing on the prominent red and black text. There are no people, objects, or additional scenes in the frame. It gives a professional and educational impression.",
      "frame_path": "storage/frame_0_0.jpg",
      "frame_number": 0
    },
    {
      "timestamp": 30,
      "timestamp_formatted": "00:30",
      "description": "The image is a minimalist, hand-drawn illustration. On the left, there is a large depiction of an angelic figure with a peaceful expression, curly hair, a halo, and small wings. The angel is holding a lyre, and the colors are muted, primarily beige and light brown, giving it a celestial, ethereal feel. Below the angel, there is a donkey's face, looking upwards.\n\nOn the right, there is a figure resembling a historical artist. The character is wearing a beret and holds a paintbrush in one hand. They appear to be observing the angelic scene, perhaps involved in creating or admiring it.\n\nThere's scaffolding drawn in simple lines, indicating an artistic setting, possibly a studio or space where the artist is working. The background is plain and light-colored, ensuring the focus remains on the illustrated characters and their interaction. The overall use of color is subtle, relying heavily on line work to convey detail and form.",
      "frame_path": "storage/frame_1_49.jpg",
      "frame_number": 1
    },
    {
      "timestamp": 60,
      "timestamp_formatted": "01:00",
      "description": "The video frame depicts a simple illustration with a stage setting. Three figures are present: two adults and a child. The adult on the left appears to be a woman with curly hair, wearing glasses and a long skirt. She is shaking hands with a child, who has dark hair tied in pigtails and is smiling. The child is the center of attention, suggesting an important moment. To the right is another adult, a man with a bald head and wearing a suit, watching the handshake.\n\nAbove the stage, a banner reads \"ELECTED SCHOOL PRESIDENT\" with each letter in a different color, giving a cheerful and festive look. The background features pink curtains and several microphones on stands are placed on the stage. In the foreground, a few raised hands are visible, possibly indicating an audience. The color palette is mostly muted with pink and pastel tones. The illustration style is simple and childlike, adding a playful charm to the scene.",
      "frame_path": "storage/frame_2_99.jpg",
      "frame_number": 2
    },
    {
      "timestamp": 90,
      "timestamp_formatted": "01:30",
      "description": "The image is an illustration depicting a bedroom scene. Key elements include:\n\n1. **Bed and Person**: There is a simple bed with a minimalist design. A person is under a large white blanket, with only a part of their hair visible.\n\n2. **Smartphone**: A smartphone is placed on the bed, next to the person.\n\n3. **Posters**: Five posters are on the wall behind the bed. Each poster has different artwork and text:\n\n   - **Poster 1**: Titled \"WHEN THE WIND BLOWS,\" featuring an explosion with two figures below.\n   \n   - **Poster 2**: Titled \"PLASTIC OCEAN,\" depicting a white object, possibly a whale or an iceberg, in a blue, ocean-like setting.\n   \n   - **Poster 3**: Titled \"AN INCONVENIENT TRUTH,\" featuring a hurricane-like design in monochrome.\n   \n   - **Poster 4**: Titled \"DON'T LOOK UP,\" with an illustration of what appears to be a comet or meteor against an orange sky.\n   \n   - **Poster 5**: Titled \"THE DAY AFTER TOMORROW,\" showing an image of a frozen urban landscape with a statue.\n\n4. **Colors**: The color palette is predominantly neutral and pastel with white, gray, blue, orange, and muted tones providing a calm atmosphere.\n\nThe setting suggests a personal space with an interest in environmental and apocalyptic themes, as",
      "frame_path": "storage/frame_3_149.jpg",
      "frame_number": 3
    },
    {
      "timestamp": 120,
      "timestamp_formatted": "02:00",
      "description": "This is a black-and-white sketch drawing. Here’s a detailed description:\n\n- **Setting:** The scene depicts an urban street, with a bus prominently featured.\n- **Bus:** A large vehicle occupies the left side of the image. It is stylized with simple lines and has visible windows and large wheels. The bus has a driver visible through the windshield.\n- **Person:** To the right, a person is standing near a bus stop. They are wearing glasses, a skirt or long dress, and a top, and are holding a small purse. \n- **Bus Stop:** There is a sign with the word “BUS” indicating a bus stop.\n- **Colors:** The image is in grayscale, with no additional colors apart from shades of black, white, and gray.\n- **Art Style:** The drawing is simplistic and cartoon-like, using minimal detail and bold lines.\n\nThe person appears to be waiting for the bus, with a neutral or calm demeanor. The overall scene is lighthearted, with a humorous or whimsical style typical of a cartoon sketch.",
      "frame_path": "storage/frame_4_199.jpg",
      "frame_number": 4
    },
    {
      "timestamp": 150,
      "timestamp_formatted": "02:30",
      "description": "The image depicts a simple, hand-drawn scene featuring three cartoon characters and a board. Here's a detailed breakdown:\n\n1. **Characters:**\n   - There are three cartoon characters, each simply drawn with distinct features.\n   - The character on the left wears a wide-brimmed hat, possibly signifying an adult or an organizer.\n   - Two smaller characters stand to the right. One has a light-colored face and hair, with a heart near their head, possibly indicating affection or enthusiasm.\n   - The other small character has a darker face and hair and is pointing at the board with a stick, possibly explaining or instructing.\n\n2. **Objects:**\n   - A large board is set up on a stand with the title \"BEACH CLEANUP PLAN\" at the top.\n   - The board is divided into sections with illustrations:\n     - Three stick figures at different locations.\n     - Groups of drawn bags, likely symbolizing collected trash.\n     - Waves are illustrated at the bottom of the board, indicating the beach setting.\n     - Green dashed lines might signify sections or divisions of the beach area.\n\n3. **Setting:**\n   - The scene is minimalistic, with an implied outdoor setting, possibly on the beach, as suggested by the title and waves.\n   - There are faint outlines of flags or tents in the background on the left, indicating an event setting.\n\n4. **Colors:**\n   - The image uses a simple color palette: black lines for outlines with",
      "frame_path": "storage/frame_5_249.jpg",
      "frame_number": 5
    }
  ],
  "processed_at": "2025-06-02T18:41:38.032772",
  "status": "completed"
}